## заменить "язык" на "шашлык"
##При замене нужно пользоваться функцией re.sub.
##Если слово было написано с большой буквы,
##то и после замены оно должно быть написано с большой буквы.


import re

def search(filename):
    with open(filename, 'r', encoding='utf-8') as f:
        page = f.read()
        r = re.sub('([1234567890,—\[\]↑№!\"\'«»?.,;:-|/+*{}<>@#$%-^&() ])язык(а|у|ом|е|и|ов|ам|ами|ах)?([1234567890,—\[\]↑№!\"\'«»?.,;:-|/+*{}<>@#$%-^& ()])',\
                   r'\1шашлык\2\3', page)
        r = re.sub('([1234567890,—\[\]↑№!\"\'«»?.,;:-|/+*{}<>@#$%-^&() ])Язык(а|у|ом|е|и|ов|ам|ами|ах)?([1234567890,—\[\]↑№!\"\'«»?.,;:-|/+*{}<>@#$%-^& ()])',\
                   r'\1Шашлык\2\3', r)
    with open('result.html', 'w', encoding='utf-8') as t:
        t.write(r)

def main():
    search('ling.html')

if __name__ == "__main__":        
    main()

